chenshuang888/esp32-p4-demo1/sdkconfig.defaults
# Waveshare ESP32-P4-WIFI6-Touch-LCD-7B 板级默认配置
# 参考: esp32p4_research/ESP32-P4-WIFI6-Touch-LCD-7B/examples/ESP-IDF/*/sdkconfig.defaults
#
# 注意: 厂家示例是用 ESP-IDF 5.4.0 生成的; 本项目使用 ESP-IDF 5.4.3。
#       5.4.3 中 200MHz PSRAM 依赖 IDF_EXPERIMENTAL_FEATURES，故一并打开。

CONFIG_IDF_TARGET="esp32p4"

# ---- Flash ----
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_SPI_FLASH_SUPPORT_GD_CHIP=y

# ---- PSRAM ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y

# ---- Cache ----
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# ---- 分区表 (自定义, 见同目录 partitions.csv) ----
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- IDF 5.4.3: 200MHz PSRAM 需要打开实验特性才可见 ----
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
